---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsPipeInnerDiamParam
source: html/edf38a7e-e535-eaa4-d9d0-040ba921dbda.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsPipeInnerDiamParam Property

"Inside Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsPipeInnerDiamParam { get; }
```